RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_spi.c
/**
 *******************************************************************************
 * @file  hc32f4a0_spi.c
 * @brief This file provides firmware functions to manage the Serial Peripheral
 *        Interface(SPI).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Wangmin         First version
   2020-08-31       Wangmin         Modify for MISRAC2012
   2020-10-13       Wangmin         Define variable for count as __IO type
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_spi.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_SPI SPI
 * @brief Serial Peripheral Interface Driver Library
 * @{
 */

#if (DDL_SPI_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup SPI_Local_Macros SPI Local Macros
 * @{
 */

#define SPI_CFG1_DEFAULT        (0x00000010UL)
#define SPI_CFG2_DEFAULT        (0x00000F1DUL)
#define SPI_SR_DEFAULT          (0x00000020UL)

#define SPI_IRQ_MASK            ( SPI_INT_ERROR                   |            \
                                  SPI_INT_TX_BUFFER_EMPTY         |            \
                                  SPI_INT_RX_BUFFER_FULL          |            \
                                  SPI_INT_IDLE )
#define SPI_GET_STD_MASK        ( SPI_FLAG_OVERLOAD               |            \
                                  SPI_FLAG_IDLE                   |            \
                                  SPI_FLAG_MODE_FAULT             |            \
                                  SPI_FLAG_PARITY_ERROR           |            \
                                  SPI_FLAG_UNDERLOAD              |            \
                                  SPI_FLAG_TX_BUFFER_EMPTY        |            \
                                  SPI_FLAG_RX_BUFFER_FULL )
#define SPI_CLR_STD_MASK        ( SPI_FLAG_OVERLOAD               |            \
                                  SPI_FLAG_MODE_FAULT             |            \
                                  SPI_FLAG_PARITY_ERROR           |            \
                                  SPI_FLAG_UNDERLOAD )

#define SPI_SS0_VALID_CFG        (0UL)
#define SPI_SS1_VALID_CFG        (SPI_CFG2_SSA_0)
#define SPI_SS2_VALID_CFG        (SPI_CFG2_SSA_1)
#define SPI_SS3_VALID_CFG        (SPI_CFG2_SSA_0 | SPI_CFG2_SSA_1)

/**
 * @defgroup SPI_Check_Parameters_Validity SPI check parameters validity
 * @{
 */

/*! Parameter valid check for SPI peripheral */
#define IS_VALID_SPI_UNIT(x)                                                   \
(   (M4_SPI1 == (x))                        ||                                 \
    (M4_SPI2 == (x))                        ||                                 \
    (M4_SPI3 == (x))                        ||                                 \
    (M4_SPI4 == (x))                        ||                                 \
    (M4_SPI5 == (x))                        ||                                 \
    (M4_SPI6 == (x)))

/*! Parameter valid check for SPI wire mode */
#define IS_SPI_WIRE_MODE(x)                                                    \
(   ((x) == SPI_WIRE_4)                     ||                                 \
    ((x) == SPI_WIRE_3))

/*! Parameter valid check for SPI transfer mode */
#define IS_SPI_TRANS_MODE(x)                                                   \
(   ((x) == SPI_FULL_DUPLEX)                ||                                 \
    ((x) == SPI_SEND_ONLY))

/*! Parameter valid check for SPI master slave mode */
#define IS_SPI_MASTER_SLAVE(x)                                                 \
(   ((x) == SPI_SLAVE)                      ||                                 \
    ((x) == SPI_MASTER))

/*! Parameter valid check for SPI loopback mode */
#define IS_SPI_SPLPBK(x)                                                       \
(   ((x) == SPI_SPLPBK_INVALID)             ||                                 \
    ((x) == SPI_SPLPBK_MOSI_INVERT)         ||                                 \
    ((x) == SPI_SPLPBK_MOSI))

/*! Parameter valid check for SPI communication suspend function status */
#define IS_SPI_SUSP_MODE_STD(x)                                                \
(   ((x) == SPI_COM_SUSP_FUNC_OFF)          ||                                 \
    ((x) == SPI_COM_SUSP_FUNC_ON))

/*! Parameter valid check for SPI fault dectet function status */
#define IS_SPI_MODFE_CMD(x)                                                    \
(   ((x) == SPI_MODFE_DISABLE)              ||                                 \
    ((x) == SPI_MODFE_ENABLE))

/*! Parameter valid check for SPI parity check mode */
#define IS_SPI_PARITY_CHECK(x)                                                 \
(   ((x) == SPI_PARITY_INVALID)             ||                                 \
    ((x) == SPI_PARITY_EVEN)                ||                                 \
    ((x) == SPI_PARITY_ODD))

/*! Parameter valid check for SPI interval time delay */
#define IS_SPI_INTERVAL_DELAY(x)                                               \
(   ((x) == SPI_INTERVAL_TIME_1SCK_2PCLK1)  ||                                 \
    ((x) == SPI_INTERVAL_TIME_2SCK_2PCLK1)  ||                                 \
    ((x) == SPI_INTERVAL_TIME_3SCK_2PCLK1)  ||                                 \
    ((x) == SPI_INTERVAL_TIME_4SCK_2PCLK1)  ||                                 \
    ((x) == SPI_INTERVAL_TIME_5SCK_2PCLK1)  ||                                 \
    ((x) == SPI_INTERVAL_TIME_6SCK_2PCLK1)  ||                                 \
    ((x) == SPI_INTERVAL_TIME_7SCK_2PCLK1)  ||                                 \
    ((x) == SPI_INTERVAL_TIME_8SCK_2PCLK1))

/*! Parameter valid check for SPI release time delay */
#define IS_SPI_RELEASE_DELAY(x)                                                \
(   ((x) == SPI_RELEASE_TIME_1SCK)          ||                                 \
    ((x) == SPI_RELEASE_TIME_2SCK)          ||                                 \
    ((x) == SPI_RELEASE_TIME_3SCK)          ||                                 \
    ((x) == SPI_RELEASE_TIME_4SCK)          ||                                 \
    ((x) == SPI_RELEASE_TIME_5SCK)          ||                                 \
    ((x) == SPI_RELEASE_TIME_6SCK)          ||                                 \
    ((x) == SPI_RELEASE_TIME_7SCK)          ||                                 \
    ((x) == SPI_RELEASE_TIME_8SCK))

/*! Parameter valid check for SPI Setup time delay delay */
#define IS_SPI_SETUP_DELAY(x)                                                  \
(   ((x) == SPI_SETUP_TIME_1SCK)            ||                                 \
    ((x) == SPI_SETUP_TIME_2SCK)            ||                                 \
    ((x) == SPI_SETUP_TIME_3SCK)            ||                                 \
    ((x) == SPI_SETUP_TIME_4SCK)            ||                                 \
    ((x) == SPI_SETUP_TIME_5SCK)            ||                                 \
    ((x) == SPI_SETUP_TIME_6SCK)            ||                                 \
    ((x) == SPI_SETUP_TIME_7SCK)            ||                                 \
    ((x) == SPI_SETUP_TIME_8SCK))

