RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_spi.c
    DDL_ASSERT(IS_VALID_SPI_UNIT(SPIx));

    if (NULL != pstcInit)
    {
        DDL_ASSERT(IS_SPI_WIRE_MODE(pstcInit->u32WireMode));
        DDL_ASSERT(IS_SPI_TRANS_MODE(pstcInit->u32TransMode));
        DDL_ASSERT(IS_SPI_MASTER_SLAVE(pstcInit->u32MasterSlave));
        DDL_ASSERT(IS_SPI_SUSP_MODE_STD(pstcInit->u32SuspMode));
        DDL_ASSERT(IS_SPI_MODFE_CMD(pstcInit->u32Modfe));
        DDL_ASSERT(IS_SPI_PARITY_CHECK(pstcInit->u32Parity));
        DDL_ASSERT(IS_SPI_SPI_MODE(pstcInit->u32SpiMode));
        DDL_ASSERT(IS_SPI_BIT_RATE_DIV(pstcInit->u32BaudRatePrescaler));
        DDL_ASSERT(IS_SPI_DATA_SIZE(pstcInit->u32DataBits));
        DDL_ASSERT(IS_SPI_FIRST_BIT(pstcInit->u32FirstBit));
        DDL_ASSERT(IS_SPI_DATA_FRAME(pstcInit->u32FrameLevel));

        /* Configuration parameter check */
        if((SPI_MASTER == pstcInit->u32MasterSlave)&&(SPI_MODFE_ENABLE == pstcInit->u32Modfe))
        {
            /* pstcInit->u32Modfe can not be SPI_MODFE_ENABLE in master mode */
        }
        else if((SPI_WIRE_3 == pstcInit->u32WireMode)
                && (SPI_SLAVE == pstcInit->u32MasterSlave)
                 &&((SPI_MODE_0 == pstcInit->u32SpiMode)||(SPI_MODE_2 == pstcInit->u32SpiMode)))
        {
            /* SPI_WIRE_3 can not support SPI_MODE_0 and SPI_MODE_2 */
        }
        else
        {
            WRITE_REG32(SPIx->CR1, pstcInit->u32WireMode
                                   | pstcInit->u32TransMode
                                   | pstcInit->u32MasterSlave
                                   | pstcInit->u32SuspMode
                                   | pstcInit->u32Modfe
                                   | pstcInit->u32Parity );

            MODIFY_REG32(SPIx->CFG1, SPI_CFG1_FTHLV, pstcInit->u32FrameLevel);

            WRITE_REG32(SPIx->CFG2, pstcInit->u32SpiMode
                                    | pstcInit->u32BaudRatePrescaler
                                    | pstcInit->u32DataBits
                                    | pstcInit->u32FirstBit);

            enRet = Ok;
        }
    }
    return enRet;
}

/**
 * @brief  De-initializes the SPI peripheral.
 * @param  [in]  SPIx               SPI unit
 *         @arg M4_SPI1
 *         @arg M4_SPI2
 *         @arg M4_SPI3
 *         @arg M4_SPI4
 *         @arg M4_SPI5
 *         @arg M4_SPI6
 * @retval None
 */
void SPI_DeInit(M4_SPI_TypeDef *SPIx)
{
    DDL_ASSERT(IS_VALID_SPI_UNIT(SPIx));

    SPI_FunctionCmd(SPIx, Disable);

    WRITE_REG32(SPIx->CR1, 0x00000000UL);
    WRITE_REG32(SPIx->CFG1, SPI_CFG1_DEFAULT);
    WRITE_REG32(SPIx->CFG2, SPI_CFG2_DEFAULT);
    WRITE_REG32(SPIx->SR, SPI_SR_DEFAULT);
}

/**
 * @brief  Set a default value for the SPI initialization structure.
 * @param  [in]  pstcInit           Pointer to a stc_spi_init_t structure that
 *                                  contains configuration information.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pstcInit == NULL.
 */
en_result_t SPI_StructInit(stc_spi_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (NULL != pstcInit)
    {
        pstcInit->u32WireMode          = SPI_WIRE_4;
        pstcInit->u32TransMode         = SPI_FULL_DUPLEX;
        pstcInit->u32MasterSlave       = SPI_MASTER;
        pstcInit->u32SuspMode          = SPI_COM_SUSP_FUNC_OFF;
        pstcInit->u32Modfe             = SPI_MODFE_DISABLE;
        pstcInit->u32Parity            = SPI_PARITY_INVALID;
        pstcInit->u32SpiMode           = SPI_MODE_0;
        pstcInit->u32BaudRatePrescaler = SPI_BR_PCLK1_DIV8;
        pstcInit->u32DataBits          = SPI_DATA_SIZE_8BIT;
        pstcInit->u32FirstBit          = SPI_FIRST_MSB;
        pstcInit->u32FrameLevel        = SPI_FRAME_1;

        enRet = Ok;
    }
    return enRet;
}

/**
 * @brief  Enable or disable SPI interrupt.
 * @param  [in]  SPIx               SPI unit
 *         @arg M4_SPI1
 *         @arg M4_SPI2
 *         @arg M4_SPI3
 *         @arg M4_SPI4
 *         @arg M4_SPI5
 *         @arg M4_SPI6
 * @param  [in]  u32IntType         SPI interrupt type. Can be one or any
 *                                  combination of the parameter @ref SPI_Interrupt_Type_Define
 *   @arg  SPI_INT_ERROR
 *   @arg  SPI_INT_TX_BUFFER_EMPTY
 *   @arg  SPI_INT_RX_BUFFER_FULL
 *   @arg  SPI_INT_IDLE
 * @param  [in]  enNewState         An en_functional_state_t enumeration value.
 *   @arg  Enable:                  Enable the specified interrupt of SPI.
 *   @arg  Disable:                 Disable the specified interrupt of SPI.
 * @retval None
 */
void SPI_IntCmd(M4_SPI_TypeDef *SPIx, uint32_t u32IntType, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_SPI_UNIT(SPIx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_SPI_IRQ_FLAG(u32IntType));

    if (enNewState == Enable)
    {
        SET_REG32_BIT(SPIx->CR1, u32IntType);
    }
    else
    {
        CLEAR_REG32_BIT(SPIx->CR1, u32IntType);
    }
}

/**
 * @brief  SPI function enable or disable.
 * @param  [in]  SPIx               SPI unit
 *         @arg M4_SPI1
 *         @arg M4_SPI2
 *         @arg M4_SPI3
 *         @arg M4_SPI4
 *         @arg M4_SPI5
 *         @arg M4_SPI6
 * @param  [in]  enNewState         An en_functional_state_t enumeration value.
 *   @arg  Enable:                  Enable SPI function.
 *   @arg  Disable:                 Disable SPI function.
 * @retval None
 */
void SPI_FunctionCmd(M4_SPI_TypeDef *SPIx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_SPI_UNIT(SPIx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        SET_REG32_BIT(SPIx->CR1, SPI_CR1_SPE);
    }
    else
    {
        CLEAR_REG32_BIT(SPIx->CR1, SPI_CR1_SPE);
    }
}

/**
 * @brief  Write SPI data register.
 * @param  [in]  SPIx           SPI unit
 *         @arg M4_SPI1
 *         @arg M4_SPI2
 *         @arg M4_SPI3
 *         @arg M4_SPI4
 *         @arg M4_SPI5
 *         @arg M4_SPI6
 * @param  [in]  u32Data        The data will be written to the data register.
 * @retval None.
 */
void SPI_WriteDataReg(M4_SPI_TypeDef *SPIx, uint32_t u32Data)
{
    DDL_ASSERT(IS_VALID_SPI_UNIT(SPIx));
    WRITE_REG32(SPIx->DR, u32Data);
}

/**
 * @brief  Read SPI data register.
 * @param  [in]  SPIx           SPI unit
 *         @arg M4_SPI1
 *         @arg M4_SPI2
 *         @arg M4_SPI3
 *         @arg M4_SPI4
 *         @arg M4_SPI5
 *         @arg M4_SPI6
 * @retval A 32-bit data of SPI data register.
 */
uint32_t SPI_ReadDataReg(const M4_SPI_TypeDef *SPIx)
{
    DDL_ASSERT(IS_VALID_SPI_UNIT(SPIx));

