RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_spi.c
        if (u32Timecount == 0U)
        {
            enRet = ErrorTimeout;
            break;
        }

        u32Tmp = READ_REG32(SPIx->DR);
        if (pvRxBuf != NULL)
        {
            if (u32BitSize <= SPI_DATA_SIZE_8BIT)
            {
                /* SPI_DATA_SIZE_4BIT ~ SPI_DATA_SIZE_8BIT */
                ((uint8_t *)pvRxBuf)[u32Count] = (uint8_t)u32Tmp;
            }
            else if(u32BitSize <= SPI_DATA_SIZE_16BIT)
            {
                /* SPI_DATA_SIZE_9BIT ~ SPI_DATA_SIZE_16BIT */
                ((uint16_t *)pvRxBuf)[u32Count] = (uint16_t)u32Tmp;
            }
            else
            {
                /* SPI_DATA_SIZE_20BIT ~ SPI_DATA_SIZE_32BIT */
                ((uint32_t *)pvRxBuf)[u32Count] = (uint32_t)u32Tmp;
            }
        }
        else
        {
            /* Dummy read */
            u32Read = READ_REG32(SPIx->DR);
        }

        u32Count++;
    }
    return enRet;
}

/**
 * @brief  SPI send data only.
 * @param  [in]  SPIx               SPI unit
 *         @arg M4_SPI1
 *         @arg M4_SPI2
 *         @arg M4_SPI3
 *         @arg M4_SPI4
 *         @arg M4_SPI5
 *         @arg M4_SPI6
 * @param  [in]  pvTxBuf            The pointer to the buffer which contains the data to be sent.
 * @param  [in]  u32Length          The length of the data in byte or half word or word.
 * @retval An en_result_t enumeration value:
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorTimeout:            SPI transmit timeout.
 */
static en_result_t SPI_Tx(M4_SPI_TypeDef *SPIx, const void *pvTxBuf, uint32_t u32Length)
{
    __IO uint32_t u32Count = 0U;
    __IO uint32_t u32Timecount;
    uint32_t u32BitSize;
    en_result_t enRet = Ok;

    /* Get data bit size, SPI_DATA_SIZE_4BIT ~ SPI_DATA_SIZE_32BIT */
    u32BitSize = READ_REG32_BIT(SPIx->CFG2, SPI_CFG2_DSIZE);

    while (u32Count < u32Length)
    {
        if (u32BitSize <= SPI_DATA_SIZE_8BIT)
        {
            /* SPI_DATA_SIZE_4BIT ~ SPI_DATA_SIZE_8BIT */
            WRITE_REG32(SPIx->DR, ((const uint8_t *)pvTxBuf)[u32Count]);
        }
        else if(u32BitSize <= SPI_DATA_SIZE_16BIT)
        {
            /* SPI_DATA_SIZE_9BIT ~ SPI_DATA_SIZE_16BIT */
            WRITE_REG32(SPIx->DR, ((const uint16_t *)pvTxBuf)[u32Count]);
        }
        else
        {
            /* SPI_DATA_SIZE_20BIT ~ SPI_DATA_SIZE_32BIT */
            WRITE_REG32(SPIx->DR, ((const uint32_t *)pvTxBuf)[u32Count]);
        }

        /* Delay about 10ms */
        u32Timecount = HCLK_VALUE/100UL;
        do
        {
            if(0UL != READ_REG32_BIT(SPIx->SR, SPI_FLAG_TX_BUFFER_EMPTY))
            {
                break;
            }
            u32Timecount--;
        } while (u32Timecount != 0U);

        if (u32Timecount == 0U)
        {
            enRet = ErrorTimeout;
        }

        u32Count++;
    }
    return enRet;
}

/**
 * @}
 */

#endif /* DDL_SPI_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
